; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-8-7)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	p0-7 - location
	p1-4 - location
	p2-0 - location
	p2-1 - location
	p3-2 - location
	p4-6 - location
	p5-0 - location
	p5-1 - location
	p5-3 - location
	p5-12 - location
	p7-1 - location
	p7-2 - location
	p7-5 - location
	p7-8 - location
	p8-1 - location
	p8-9 - location
	p9-3 - location
	p9-10 - location
	p9-11 - location
	p10-1 - location
	p10-4 - location
	p10-9 - location
	p11-0 - location
	p12-0 - location
	)
	(:init
	(at driver1 s12)
	(at driver2 s11)
	(at driver3 s0)
	(at driver4 s3)
	(at driver5 s4)
	(at truck1 s6)
	(empty truck1)
	(at truck2 s7)
	(empty truck2)
	(at truck3 s12)
	(empty truck3)
	(at truck4 s1)
	(empty truck4)
	(at truck5 s5)
	(empty truck5)
	(at truck6 s9)
	(empty truck6)
	(at truck7 s8)
	(empty truck7)
	(at truck8 s11)
	(empty truck8)
	(at package1 s2)
	(at package2 s3)
	(at package3 s12)
	(at package4 s0)
	(at package5 s2)
	(at package6 s0)
	(at package7 s0)
	(path s0 p0-7)
	(path p0-7 s0)
	(path s7 p0-7)
	(path p0-7 s7)
	(= (time-to-walk s0 p0-7) 58)
	(= (time-to-walk p0-7 s0) 58)
	(= (time-to-walk s7 p0-7) 40)
	(= (time-to-walk p0-7 s7) 40)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 96)
	(= (time-to-walk p1-4 s1) 96)
	(= (time-to-walk s4 p1-4) 45)
	(= (time-to-walk p1-4 s4) 45)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 5)
	(= (time-to-walk p2-0 s2) 5)
	(= (time-to-walk s0 p2-0) 41)
	(= (time-to-walk p2-0 s0) 41)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 16)
	(= (time-to-walk p2-1 s2) 16)
	(= (time-to-walk s1 p2-1) 92)
	(= (time-to-walk p2-1 s1) 92)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 88)
	(= (time-to-walk p3-2 s3) 88)
	(= (time-to-walk s2 p3-2) 27)
	(= (time-to-walk p3-2 s2) 27)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(= (time-to-walk s4 p4-6) 13)
	(= (time-to-walk p4-6 s4) 13)
	(= (time-to-walk s6 p4-6) 62)
	(= (time-to-walk p4-6 s6) 62)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 44)
	(= (time-to-walk p5-0 s5) 44)
	(= (time-to-walk s0 p5-0) 41)
	(= (time-to-walk p5-0 s0) 41)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 71)
	(= (time-to-walk p5-1 s5) 71)
	(= (time-to-walk s1 p5-1) 6)
	(= (time-to-walk p5-1 s1) 6)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(= (time-to-walk s5 p5-3) 40)
	(= (time-to-walk p5-3 s5) 40)
	(= (time-to-walk s3 p5-3) 30)
	(= (time-to-walk p5-3 s3) 30)
	(path s5 p5-12)
	(path p5-12 s5)
	(path s12 p5-12)
	(path p5-12 s12)
	(= (time-to-walk s5 p5-12) 37)
	(= (time-to-walk p5-12 s5) 37)
	(= (time-to-walk s12 p5-12) 47)
	(= (time-to-walk p5-12 s12) 47)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(= (time-to-walk s7 p7-1) 44)
	(= (time-to-walk p7-1 s7) 44)
	(= (time-to-walk s1 p7-1) 34)
	(= (time-to-walk p7-1 s1) 34)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(= (time-to-walk s7 p7-2) 68)
	(= (time-to-walk p7-2 s7) 68)
	(= (time-to-walk s2 p7-2) 54)
	(= (time-to-walk p7-2 s2) 54)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(= (time-to-walk s7 p7-5) 67)
	(= (time-to-walk p7-5 s7) 67)
	(= (time-to-walk s5 p7-5) 73)
	(= (time-to-walk p7-5 s5) 73)
	(path s7 p7-8)
	(path p7-8 s7)
	(path s8 p7-8)
	(path p7-8 s8)
	(= (time-to-walk s7 p7-8) 76)
	(= (time-to-walk p7-8 s7) 76)
	(= (time-to-walk s8 p7-8) 38)
	(= (time-to-walk p7-8 s8) 38)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(= (time-to-walk s8 p8-1) 75)
	(= (time-to-walk p8-1 s8) 75)
	(= (time-to-walk s1 p8-1) 42)
	(= (time-to-walk p8-1 s1) 42)
	(path s8 p8-9)
	(path p8-9 s8)
	(path s9 p8-9)
	(path p8-9 s9)
	(= (time-to-walk s8 p8-9) 73)
	(= (time-to-walk p8-9 s8) 73)
	(= (time-to-walk s9 p8-9) 33)
	(= (time-to-walk p8-9 s9) 33)
	(path s9 p9-3)
	(path p9-3 s9)
	(path s3 p9-3)
	(path p9-3 s3)
	(= (time-to-walk s9 p9-3) 82)
	(= (time-to-walk p9-3 s9) 82)
	(= (time-to-walk s3 p9-3) 68)
	(= (time-to-walk p9-3 s3) 68)
	(path s9 p9-10)
	(path p9-10 s9)
	(path s10 p9-10)
	(path p9-10 s10)
	(= (time-to-walk s9 p9-10) 77)
	(= (time-to-walk p9-10 s9) 77)
	(= (time-to-walk s10 p9-10) 87)
	(= (time-to-walk p9-10 s10) 87)
	(path s9 p9-11)
	(path p9-11 s9)
	(path s11 p9-11)
	(path p9-11 s11)
	(= (time-to-walk s9 p9-11) 9)
	(= (time-to-walk p9-11 s9) 9)
	(= (time-to-walk s11 p9-11) 92)
	(= (time-to-walk p9-11 s11) 92)
	(path s10 p10-1)
	(path p10-1 s10)
	(path s1 p10-1)
	(path p10-1 s1)
	(= (time-to-walk s10 p10-1) 78)
	(= (time-to-walk p10-1 s10) 78)
	(= (time-to-walk s1 p10-1) 97)
	(= (time-to-walk p10-1 s1) 97)
	(path s10 p10-4)
	(path p10-4 s10)
	(path s4 p10-4)
	(path p10-4 s4)
	(= (time-to-walk s10 p10-4) 19)
	(= (time-to-walk p10-4 s10) 19)
	(= (time-to-walk s4 p10-4) 91)
	(= (time-to-walk p10-4 s4) 91)
	(path s11 p11-0)
	(path p11-0 s11)
	(path s0 p11-0)
	(path p11-0 s0)
	(= (time-to-walk s11 p11-0) 58)
	(= (time-to-walk p11-0 s11) 58)
	(= (time-to-walk s0 p11-0) 62)
	(= (time-to-walk p11-0 s0) 62)
	(path s12 p12-0)
	(path p12-0 s12)
	(path s0 p12-0)
	(path p12-0 s0)
	(= (time-to-walk s12 p12-0) 32)
	(= (time-to-walk p12-0 s12) 32)
	(= (time-to-walk s0 p12-0) 28)
	(= (time-to-walk p12-0 s0) 28)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 67)
	(= (time-to-drive s1 s0) 67)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 71)
	(= (time-to-drive s5 s0) 71)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 57)
	(= (time-to-drive s6 s0) 57)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 4)
	(= (time-to-drive s8 s0) 4)
	(link s0 s11)
	(link s11 s0)
	(= (time-to-drive s0 s11) 17)
	(= (time-to-drive s11 s0) 17)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 1)
	(= (time-to-drive s7 s1) 1)
	(link s1 s11)
	(link s11 s1)
	(= (time-to-drive s1 s11) 37)
	(= (time-to-drive s11 s1) 37)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 85)
	(= (time-to-drive s1 s2) 85)
	(link s2 s8)
	(link s8 s2)
	(= (time-to-drive s2 s8) 54)
	(= (time-to-drive s8 s2) 54)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 4)
	(= (time-to-drive s0 s3) 4)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 58)
	(= (time-to-drive s6 s3) 58)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 29)
	(= (time-to-drive s8 s3) 29)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 41)
	(= (time-to-drive s7 s4) 41)
	(link s4 s11)
	(link s11 s4)
	(= (time-to-drive s4 s11) 32)
	(= (time-to-drive s11 s4) 32)
	(link s4 s12)
	(link s12 s4)
	(= (time-to-drive s4 s12) 71)
	(= (time-to-drive s12 s4) 71)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 14)
	(= (time-to-drive s8 s5) 14)
	(link s5 s9)
	(link s9 s5)
	(= (time-to-drive s5 s9) 65)
	(= (time-to-drive s9 s5) 65)
	(link s6 s12)
	(link s12 s6)
	(= (time-to-drive s6 s12) 52)
	(= (time-to-drive s12 s6) 52)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 82)
	(= (time-to-drive s6 s7) 82)
	(link s7 s9)
	(link s9 s7)
	(= (time-to-drive s7 s9) 41)
	(= (time-to-drive s9 s7) 41)
	(link s8 s4)
	(link s4 s8)
	(= (time-to-drive s8 s4) 38)
	(= (time-to-drive s4 s8) 38)
	(link s8 s12)
	(link s12 s8)
	(= (time-to-drive s8 s12) 90)
	(= (time-to-drive s12 s8) 90)
	(link s9 s1)
	(link s1 s9)
	(= (time-to-drive s9 s1) 32)
	(= (time-to-drive s1 s9) 32)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 15)
	(= (time-to-drive s2 s9) 15)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 86)
	(= (time-to-drive s8 s9) 86)
	(link s9 s10)
	(link s10 s9)
	(= (time-to-drive s9 s10) 51)
	(= (time-to-drive s10 s9) 51)
	(link s10 s1)
	(link s1 s10)
	(= (time-to-drive s10 s1) 6)
	(= (time-to-drive s1 s10) 6)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 43)
	(= (time-to-drive s7 s10) 43)
	(link s10 s11)
	(link s11 s10)
	(= (time-to-drive s10 s11) 12)
	(= (time-to-drive s11 s10) 12)
	(link s11 s3)
	(link s3 s11)
	(= (time-to-drive s11 s3) 37)
	(= (time-to-drive s3 s11) 37)
	(link s11 s6)
	(link s6 s11)
	(= (time-to-drive s11 s6) 71)
	(= (time-to-drive s6 s11) 71)
	(link s11 s8)
	(link s8 s11)
	(= (time-to-drive s11 s8) 79)
	(= (time-to-drive s8 s11) 79)
	(link s11 s9)
	(link s9 s11)
	(= (time-to-drive s11 s9) 8)
	(= (time-to-drive s9 s11) 8)
	(link s12 s9)
	(link s9 s12)
	(= (time-to-drive s12 s9) 28)
	(= (time-to-drive s9 s12) 28)
	(link s12 s10)
	(link s10 s12)
	(= (time-to-drive s12 s10) 82)
	(= (time-to-drive s10 s12) 82)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s4)
	(at driver3 s5)
	(at driver5 s5)
	(at truck3 s4)
	(at truck4 s4)
	(at truck5 s8)
	(at truck6 s7)
	(at truck7 s5)
	(at package1 s9)
	(at package2 s1)
	(at package3 s7)
	(at package4 s1)
	(at package5 s1)
	(at package6 s2)
	(at package7 s8)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 2  (driven))) (* 1  (walked))))

)

; plan
1. (walk driver5 s4 p1-4)
   deleted: (at driver5 s4)
   added: (at driver5 p1-4)
   changed: (walked) from 0 to 45
   goals met: 0 of 15
2. (walk driver3 s0 p5-0)
   deleted: (at driver3 s0)
   added: (at driver3 p5-0)
   changed: (walked) from 45 to 86
   goals met: 0 of 15
3. (load-truck package3 truck3 s12)
   deleted: (at package3 s12)
   added: (in package3 truck3)
   goals met: 0 of 15
4. (walk driver5 p1-4 s1)
   deleted: (at driver5 p1-4)
   added: (at driver5 s1)
   changed: (walked) from 86 to 182
   goals met: 0 of 15
5. (walk driver4 s3 p9-3)
   deleted: (at driver4 s3)
   added: (at driver4 p9-3)
   changed: (walked) from 182 to 250
   goals met: 0 of 15
6. (board-truck driver1 truck3 s12)
   deleted: (at driver1 s12) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 0 of 15
7. (drive-truck truck3 s12 s8 driver1)
   deleted: (at truck3 s12)
   added: (at truck3 s8)
   changed: (driven) from 0 to 90
   goals met: 0 of 15
8. (walk driver4 p9-3 s9)
   deleted: (at driver4 p9-3)
   added: (at driver4 s9)
   changed: (walked) from 250 to 332
   goals met: 0 of 15
9. (walk driver3 p5-0 s5)
   deleted: (at driver3 p5-0)
   added: (at driver3 s5)
   changed: (walked) from 332 to 376
   goals met: 1 of 15
10. (board-truck driver5 truck4 s1)
   deleted: (at driver5 s1) (empty truck4)
   added: (driving driver5 truck4)
   goals met: 1 of 15
11. (drive-truck truck4 s1 s7 driver5)
   deleted: (at truck4 s1)
   added: (at truck4 s7)
   changed: (driven) from 90 to 91
   goals met: 1 of 15
12. (drive-truck truck4 s7 s4 driver5)
   deleted: (at truck4 s7)
   added: (at truck4 s4)
   changed: (driven) from 91 to 132
   goals met: 2 of 15
13. (board-truck driver4 truck6 s9)
   deleted: (at driver4 s9) (empty truck6)
   added: (driving driver4 truck6)
   goals met: 2 of 15
14. (drive-truck truck6 s9 s7 driver4)
   deleted: (at truck6 s9)
   added: (at truck6 s7)
   changed: (driven) from 132 to 173
   goals met: 3 of 15
15. (drive-truck truck4 s4 s8 driver5)
   deleted: (at truck4 s4)
   added: (at truck4 s8)
   changed: (driven) from 173 to 211
   goals met: 2 of 15
16. (drive-truck truck3 s8 s4 driver1)
   deleted: (at truck3 s8)
   added: (at truck3 s4)
   changed: (driven) from 211 to 249
   goals met: 3 of 15
17. (drive-truck truck3 s4 s7 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s7)
   changed: (driven) from 249 to 290
   goals met: 2 of 15
18. (unload-truck package3 truck3 s7)
   deleted: (in package3 truck3)
   added: (at package3 s7)
   goals met: 3 of 15
19. (drive-truck truck3 s7 s4 driver1)
   deleted: (at truck3 s7)
   added: (at truck3 s4)
   changed: (driven) from 290 to 331
   goals met: 4 of 15
20. (drive-truck truck4 s8 s0 driver5)
   deleted: (at truck4 s8)
   added: (at truck4 s0)
   changed: (driven) from 331 to 335
   goals met: 4 of 15
21. (load-truck package7 truck4 s0)
   deleted: (at package7 s0)
   added: (in package7 truck4)
   goals met: 4 of 15
22. (load-truck package6 truck4 s0)
   deleted: (at package6 s0)
   added: (in package6 truck4)
   goals met: 4 of 15
23. (load-truck package4 truck4 s0)
   deleted: (at package4 s0)
   added: (in package4 truck4)
   goals met: 4 of 15
24. (drive-truck truck4 s0 s5 driver5)
   deleted: (at truck4 s0)
   added: (at truck4 s5)
   changed: (driven) from 335 to 406
   goals met: 4 of 15
25. (drive-truck truck4 s5 s9 driver5)
   deleted: (at truck4 s5)
   added: (at truck4 s9)
   changed: (driven) from 406 to 471
   goals met: 4 of 15
26. (drive-truck truck4 s9 s2 driver5)
   deleted: (at truck4 s9)
   added: (at truck4 s2)
   changed: (driven) from 471 to 486
   goals met: 4 of 15
27. (disembark-truck driver1 truck3 s4)
   deleted: (driving driver1 truck3)
   added: (at driver1 s4) (empty truck3)
   goals met: 5 of 15
28. (load-truck package1 truck4 s2)
   deleted: (at package1 s2)
   added: (in package1 truck4)
   goals met: 5 of 15
29. (unload-truck package6 truck4 s2)
   deleted: (in package6 truck4)
   added: (at package6 s2)
   goals met: 6 of 15
30. (load-truck package5 truck4 s2)
   deleted: (at package5 s2)
   added: (in package5 truck4)
   goals met: 6 of 15
31. (drive-truck truck4 s2 s8 driver5)
   deleted: (at truck4 s2)
   added: (at truck4 s8)
   changed: (driven) from 486 to 540
   goals met: 6 of 15
32. (unload-truck package7 truck4 s8)
   deleted: (in package7 truck4)
   added: (at package7 s8)
   goals met: 7 of 15
33. (drive-truck truck4 s8 s5 driver5)
   deleted: (at truck4 s8)
   added: (at truck4 s5)
   changed: (driven) from 540 to 554
   goals met: 7 of 15
34. (board-truck driver2 truck8 s11)
   deleted: (at driver2 s11) (empty truck8)
   added: (driving driver2 truck8)
   goals met: 7 of 15
35. (drive-truck truck8 s11 s1 driver2)
   deleted: (at truck8 s11)
   added: (at truck8 s1)
   changed: (driven) from 554 to 591
   goals met: 7 of 15
36. (drive-truck truck4 s5 s9 driver5)
   deleted: (at truck4 s5)
   added: (at truck4 s9)
   changed: (driven) from 591 to 656
   goals met: 7 of 15
37. (unload-truck package1 truck4 s9)
   deleted: (in package1 truck4)
   added: (at package1 s9)
   goals met: 8 of 15
38. (drive-truck truck4 s9 s8 driver5)
   deleted: (at truck4 s9)
   added: (at truck4 s8)
   changed: (driven) from 656 to 742
   goals met: 8 of 15
39. (drive-truck truck4 s8 s3 driver5)
   deleted: (at truck4 s8)
   added: (at truck4 s3)
   changed: (driven) from 742 to 771
   goals met: 8 of 15
40. (load-truck package2 truck4 s3)
   deleted: (at package2 s3)
   added: (in package2 truck4)
   goals met: 8 of 15
41. (drive-truck truck4 s3 s8 driver5)
   deleted: (at truck4 s3)
   added: (at truck4 s8)
   changed: (driven) from 771 to 800
   goals met: 8 of 15
42. (drive-truck truck4 s8 s5 driver5)
   deleted: (at truck4 s8)
   added: (at truck4 s5)
   changed: (driven) from 800 to 814
   goals met: 8 of 15
43. (drive-truck truck4 s5 s0 driver5)
   deleted: (at truck4 s5)
   added: (at truck4 s0)
   changed: (driven) from 814 to 885
   goals met: 8 of 15
44. (board-truck driver3 truck5 s5)
   deleted: (at driver3 s5) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 7 of 15
45. (drive-truck truck5 s5 s8 driver3)
   deleted: (at truck5 s5)
   added: (at truck5 s8)
   changed: (driven) from 885 to 899
   goals met: 8 of 15
46. (disembark-truck driver3 truck5 s8)
   deleted: (driving driver3 truck5)
   added: (at driver3 s8) (empty truck5)
   goals met: 8 of 15
47. (board-truck driver3 truck7 s8)
   deleted: (at driver3 s8) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 8 of 15
48. (drive-truck truck7 s8 s5 driver3)
   deleted: (at truck7 s8)
   added: (at truck7 s5)
   changed: (driven) from 899 to 913
   goals met: 9 of 15
49. (disembark-truck driver3 truck7 s5)
   deleted: (driving driver3 truck7)
   added: (at driver3 s5) (empty truck7)
   goals met: 10 of 15
50. (drive-truck truck4 s0 s1 driver5)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   changed: (driven) from 913 to 980
   goals met: 10 of 15
51. (disembark-truck driver5 truck4 s1)
   deleted: (driving driver5 truck4)
   added: (at driver5 s1) (empty truck4)
   goals met: 10 of 15
52. (walk driver5 s1 p5-1)
   deleted: (at driver5 s1)
   added: (at driver5 p5-1)
   changed: (walked) from 376 to 382
   goals met: 10 of 15
53. (walk driver5 p5-1 s5)
   deleted: (at driver5 p5-1)
   added: (at driver5 s5)
   changed: (walked) from 382 to 453
   goals met: 11 of 15
54. (disembark-truck driver2 truck8 s1)
   deleted: (driving driver2 truck8)
   added: (at driver2 s1) (empty truck8)
   goals met: 11 of 15
55. (unload-truck package2 truck4 s1)
   deleted: (in package2 truck4)
   added: (at package2 s1)
   goals met: 12 of 15
56. (unload-truck package4 truck4 s1)
   deleted: (in package4 truck4)
   added: (at package4 s1)
   goals met: 13 of 15
57. (unload-truck package5 truck4 s1)
   deleted: (in package5 truck4)
   added: (at package5 s1)
   goals met: 14 of 15
58. (board-truck driver2 truck4 s1)
   deleted: (at driver2 s1) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 14 of 15
59. (drive-truck truck4 s1 s11 driver2)
   deleted: (at truck4 s1)
   added: (at truck4 s11)
   changed: (driven) from 980 to 1017
   goals met: 14 of 15
60. (drive-truck truck4 s11 s4 driver2)
   deleted: (at truck4 s11)
   added: (at truck4 s4)
   changed: (driven) from 1017 to 1049
   goals met: 15 of 15
